tp1/compte_rendu.org
#+TITLE: Compte Rendu SDD calendrier
#+author: Cliquot Théo & Marie Bornet
 
* Présentation générale
  
** Objet du TP
  #+BEGIN_QUOTE
  On gère un échéancier (ou un agenda) grâce à une liste chaînée à deux niveaux.
  #+END_QUOTE

  Le but de ce TP est de concevoir un emploi du temps consistant en des semaines
  et chaque semaine pouvant contenir plusieurs actions. On doit pouvoir réaliser
  des actions basiques avec ce calendrier, notamment afficher, ajouter ou
  supprimer des actions, charger ou sauvegarder une calendrier depuis un fichier
  ...
  Pour cela On va se servir d'un structure de données déjà vu en cours : la
  liste chaînée.


** Les structures de données

*** Action

    L'action est caractérisée par un jour de la semaine et une heure, on donne à
    chaque action un nom permettant de l'identifier facilement en moins de 10
    caractères.

    
    Dans le cadre d'un calendrier, pouvoir contrôler qu'une seule action ne nous
    intéresse pas. C'est pour cela qu'on va préférer gérer une liste d'action,
    il va donc nous falloir en plus des infos propres à chaque action un nouveau
    champ que l'on va nommer suivant qui va nous indiquer si il y a une autre
    action de prévu après celle en cours.

    #+BEGIN_SRC c 
      typedef struct action {
	char day;            // Jour de la semaine (de 1 a 7)
	char hour[3];        // Heure (de 00 a 24)
	char name[10];       // nom de l'action
	struct action *suiv; // action suivante
      } action_t;
#+END_SRC
    
    En ce qui concerne la liste d'action, on va utiliser une tête réel qui pointera
    vers la tête de notre liste. Ainsi une liste d'action n'est pas à proprement
    parlé une structure, cependant on va utiliser un define pour la créer.

#+BEGIN_SRC c
  #define listAction_t action_t *
#+END_SRC

    Une seule action peut avoir le même jour et la même heure dans la même liste (On ne
    peut avoir 2 cours sur le même crenau et le même jour par exemple)

    
