calendar/compte_rendu.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-20 lun. 10:18 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Compte Rendu SDD calendrier</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Cliquot Théo &amp; Marie Bornet" />
</head>
<body>
<div id="content">
<h1 class="title">Compte Rendu SDD calendrier</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge8057c7">1. Présentation générale</a>
<ul>
<li><a href="#orgccc2c57">1.1. Objet du TP</a></li>
<li><a href="#org9f50610">1.2. Les structures de données</a>
<ul>
<li><a href="#org34d024c">1.2.1. Action</a></li>
<li><a href="#orgd76492f">1.2.2. Semaine</a></li>
</ul>
</li>
<li><a href="#org4087c5a">1.3. Les fichiers de données</a></li>
<li><a href="#org1010fed">1.4. Organisation du code source</a>
<ul>
<li><a href="#org75aa037">1.4.1. Action.c</a></li>
<li><a href="#org00f1b9e">1.4.2. semaine.c</a></li>
<li><a href="#orgd0bc490">1.4.3. menu.c</a></li>
<li><a href="#org6b93782">1.4.4. test.c</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org37ef291">2. Fonctions</a>
<ul>
<li><a href="#org5e1b509">2.1. Fonctions actions</a>
<ul>
<li><a href="#org5853d31">2.1.1. Sous procédures</a></li>
<li><a href="#org750b61e">2.1.2. Procédures</a></li>
</ul>
</li>
<li><a href="#org3b09a5f">2.2. Fonctions semaines</a>
<ul>
<li><a href="#orgb602ebb">2.2.1. Sous procédures</a></li>
<li><a href="#org350c06a">2.2.2. Procedures</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6613b4e">3. Exécution</a>
<ul>
<li><a href="#org3d4ccbe">3.1. Makefile</a></li>
<li><a href="#org6923587">3.2. Jeux de tests</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge8057c7" class="outline-2">
<h2 id="orge8057c7"><span class="section-number-2">1.</span> Présentation générale</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgccc2c57" class="outline-3">
<h3 id="orgccc2c57"><span class="section-number-3">1.1.</span> Objet du TP</h3>
<div class="outline-text-3" id="text-1-1">
<blockquote>
<p>
On gère un échéancier (ou un agenda) grâce à une liste chaînée à deux niveaux.
</p>
</blockquote>

<p>
Le but de ce TP est de concevoir un emploi du temps consistant en des semaines
et chaque semaine pouvant contenir plusieurs actions. On doit pouvoir réaliser
des actions basiques avec ce calendrier, notamment afficher, ajouter ou
supprimer des actions, charger ou sauvegarder une calendrier depuis un fichier
&#x2026;
Pour cela On va se servir d'un structure de données déjà vu en cours : la
liste chaînée.
</p>
</div>
</div>


<div id="outline-container-org9f50610" class="outline-3">
<h3 id="org9f50610"><span class="section-number-3">1.2.</span> Les structures de données</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org34d024c" class="outline-4">
<h4 id="org34d024c"><span class="section-number-4">1.2.1.</span> Action</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
L'action est caractérisée par un jour de la semaine et une heure, on donne à
chaque action un nom permettant de l'identifier facilement en moins de 10
caractères.
</p>


<p>
Dans le cadre d'un calendrier, pouvoir contrôler qu'une seule action ne nous
intéresse pas. C'est pour cela qu'on va préférer gérer une liste d'action,
il va donc nous falloir en plus des infos propres à chaque action un nouveau
champ que l'on va nommer suivant qui va nous indiquer si il y a une autre
action de prévu après celle en cours.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #6E8EE5;">typedef</span> <span style="color: #6E8EE5;">struct</span> <span style="color: #7392E5;">action</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">day</span>;            <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Jour de la semaine (de 1 a 7)</span>
  <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">hour</span><span style="color: #93a8c6;">[</span>3<span style="color: #93a8c6;">]</span>;        <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Heure (de 00 a 24)</span>
  <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">name</span><span style="color: #93a8c6;">[</span>10<span style="color: #93a8c6;">]</span>;       <span style="color: #656C7D;">// </span><span style="color: #656C7D;">nom de l'action</span>
  <span style="color: #6E8EE5;">struct</span> <span style="color: #7392E5;">action</span> *<span style="color: #CBD4EA;">suiv</span>; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">action suivante</span>
<span style="color: #8c8c8c;">}</span> <span style="color: #7392E5;">action_t</span>;
</pre>
</div>

<p>
En ce qui concerne la liste d'action, on va utiliser une tête réel qui pointera
vers la tête de notre liste. Ainsi une liste d'action n'est pas à proprement
parlé une structure, cependant on va utiliser un define pour la créer.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #b0c4de;">#define</span> <span style="color: #CBD4EA;">listAction_t</span> action_t *
</pre>
</div>

<p>
Une seule action peut avoir le même jour et la même heure dans la même liste (On ne
peut avoir 2 cours sur le même crenau et le même jour par exemple)
</p>
</div>
</div>
