tp1/compte_rendu.org
*** Semaine

    La semaine se rapproche très fortement dans sa construction avec la
    structure action. En effet On va gérer une semaine de la même façon que l'on
    gère une action, c'est à dire qu'une semaine sera une cellule ce qui nous
    permettra de créer une liste de semaine. Une semaine sera aussi unique dans
    une liste en fonction de son année et de son numéro.

    Une semaine est constitué comme dit précédemment d'une année, d'un numéro de
    semaine mais aussi d'un pointeur vers la semaine qui suit celle en cours et
    d'une liste d'action, représentant les actions à faire pour cette semaine.

    #+BEGIN_SRC c
  typedef struct week {
  char year[5];         // Annee de la semaine
  char numWeek[3];      // Jour de la semaine (01 a 53)
  struct week *suiv;    // Semaine suivante
  listAction_t listAct; // Actions de la semaine
} week_t;

#define listWeek_t week_t *
#+END_SRC

    Un choix à était fait dans action et semaine de séparer le jour de l'heure
    (pour action) et l'année du numéro de semaine (pour la semaine) pour des
    raisons de modularité et d'affichage. En effet même si cette séparation nous force
    dans certaines partis de notre code à dupliquer les comparaisons et
    l'alourdit donc. Elle nous semblait avantageuses du point de vue de la
    compréhension globale du code en plus d'être beaucoup plus simple à modifier
    si on voulait changer la façon dans nos attributs sont stockés.

    En ce qui concerne la façon dont est stocké les différents attributs, nous
    avons privilégié les caractères (char) au entier (int) pour des raison
    d'occupations. En effet 2 ou 3 caractères prennent moins de place qu'un
    entier, et ceux-ci suffisent largement.


** Les fichiers de données
   
   Les seuls fichier de données nécessaires dans notre cas (entrée comme sortie)
   et celui décrit dans l'énoncé

   #+begin_quote
   fichier texte où chaque ligne donne, sans séparateur :
   
   année, semaine, jour, heure (sans espace), libellé de l’action sur 10 caractères
   (complété avec des espace si besoin)
   
   Exemple de ligne : 202215108TPs de SDD
   #+end_quote

   En voici un exemple que l'on a utiliser pour tester notre programme:

   #+begin_example
   202215108TP DE SDD
   202315108prog_fonc
   201015108COUCOU
   202215108TP DE SDD
   200007504TP CSN
   200007510TP CSN2
   202315310prog_fonc2
   #+end_example
   
   
** Organisation du code source

  Le code source est divisé en 4 fichiers (+ quelques fichiers headers pour
  connecter le tout). Les commentaires expliquant les fonctions se trouvent dans
  les headers pour des raisons de lisibilité. 

*** Action.c
  
  Ce fichier contient la déclaration de la structure action (défini plus tôt)
  ainsi que toutes les fonctions se rapportant à celle-ci, On a notamment les
  fonctions permettant d'allouer de libérer une action, de la chercher,insérer
  ou supprimer d'une liste, de la comparer avec une autre et enfin d'afficher
  une liste d'action de façon propre.

  
*** semaine.c
  
  Ce fichier contient la déclaration de la structure semaine (défini plus tôt)
  ainsi que toutes les fonctions se rapportant à celle-ci. On a exactement les
  mêmes fonctions que celle vu précédemment pour les actions, même cette fois-ci
  pour les semaines, ainsi que quelques fonctions supplémentaires provenant du
  faites que les actions vont partie intégrante des semaines. On a donc en plus
  des fonctions pour chercher, supprimer ou insérer des actions dans une liste
  de semaine.

  
*** menu.c

  Ce fichier contient Le menu afin de gérer de façon clair et simplifier la
  gestion de notre calendrier, c'est notamment dans ce fichier que tous ce qui
  concerne la lecture ou écriture du calendrier depuis un fichier et faite.
  Pour le compiler il suffit d'utiliser la commande make afin d'appeler le
  makefile (cf : makefile).
  

*** test.c

  Ce fichier contiens tous les jeux de tests afin de vérifier que nos
  différentes fonctions produisent bien le résultat escompté. Pour le compiler
  il suffit d'appeler le makefile avec comme argument test (cf : makefile) 

  
