calendar/compte_rendu.html


<div id="outline-container-orgd76492f" class="outline-4">
<h4 id="orgd76492f"><span class="section-number-4">1.2.2.</span> Semaine</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
La semaine se rapproche très fortement dans sa construction avec la
structure action. En effet On va gérer une semaine de la même façon que l'on
gère une action, c'est à dire qu'une semaine sera une cellule ce qui nous
permettra de créer une liste de semaine. Une semaine sera aussi unique dans
une liste en fonction de son année et de son numéro.
</p>

<p>
Une semaine est constitué comme dit précédemment d'une année, d'un numéro de
semaine mais aussi d'un pointeur vers la semaine qui suit celle en cours et
d'une liste d'action, représentant les actions à faire pour cette semaine.
</p>

<div class="org-src-container">
<pre class="src src-c">  <span style="color: #6E8EE5;">typedef</span> <span style="color: #6E8EE5;">struct</span> <span style="color: #7392E5;">week</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">year</span><span style="color: #93a8c6;">[</span>5<span style="color: #93a8c6;">]</span>;         <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Annee de la semaine</span>
  <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">numWeek</span><span style="color: #93a8c6;">[</span>3<span style="color: #93a8c6;">]</span>;      <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Jour de la semaine (01 a 53)</span>
  <span style="color: #6E8EE5;">struct</span> <span style="color: #7392E5;">week</span> *<span style="color: #CBD4EA;">suiv</span>;    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Semaine suivante</span>
  <span style="color: #7392E5;">listAction_t</span> <span style="color: #CBD4EA;">listAct</span>; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Actions de la semaine</span>
<span style="color: #8c8c8c;">}</span> <span style="color: #7392E5;">week_t</span>;

<span style="color: #b0c4de;">#define</span> <span style="color: #CBD4EA;">listWeek_t</span> week_t *
</pre>
</div>

<p>
Un choix à était fait dans action et semaine de séparer le jour de l'heure
(pour action) et l'année du numéro de semaine (pour la semaine) pour des
raisons de modularité et d'affichage. En effet même si cette séparation nous force
dans certaines partis de notre code à dupliquer les comparaisons et
l'alourdit donc. Elle nous semblait avantageuses du point de vue de la
compréhension globale du code en plus d'être beaucoup plus simple à modifier
si on voulait changer la façon dans nos attributs sont stockés.
</p>

<p>
En ce qui concerne la façon dont est stocké les différents attributs, nous
avons privilégié les caractères (char) au entier (int) pour des raison
d'occupations. En effet 2 ou 3 caractères prennent moins de place qu'un
entier, et ceux-ci suffisent largement.
</p>
</div>
</div>
</div>


<div id="outline-container-org4087c5a" class="outline-3">
<h3 id="org4087c5a"><span class="section-number-3">1.3.</span> Les fichiers de données</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Les seuls fichier de données nécessaires dans notre cas (entrée comme sortie)
et celui décrit dans l'énoncé
</p>

<blockquote>
<p>
fichier texte où chaque ligne donne, sans séparateur :
</p>

<p>
année, semaine, jour, heure (sans espace), libellé de l’action sur 10 caractères
(complété avec des espace si besoin)
</p>

<p>
Exemple de ligne : 202215108TPs de SDD
</p>
</blockquote>

<p>
En voici un exemple que l'on a utiliser pour tester notre programme:
</p>

<pre class="example" id="org30e596c">
202215108TP DE SDD
202315108prog_fonc
201015108COUCOU
202215108TP DE SDD
200007504TP CSN
200007510TP CSN2
202315310prog_fonc2
</pre>
</div>
</div>


<div id="outline-container-org1010fed" class="outline-3">
<h3 id="org1010fed"><span class="section-number-3">1.4.</span> Organisation du code source</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Le code source est divisé en 4 fichiers (+ quelques fichiers headers pour
connecter le tout). Les commentaires expliquant les fonctions se trouvent dans
les headers pour des raisons de lisibilité. 
</p>
</div>

<div id="outline-container-org75aa037" class="outline-4">
<h4 id="org75aa037"><span class="section-number-4">1.4.1.</span> Action.c</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Ce fichier contient la déclaration de la structure action (défini plus tôt)
ainsi que toutes les fonctions se rapportant à celle-ci, On a notamment les
fonctions permettant d'allouer de libérer une action, de la chercher,insérer
ou supprimer d'une liste, de la comparer avec une autre et enfin d'afficher
une liste d'action de façon propre.
</p>
</div>
</div>


<div id="outline-container-org00f1b9e" class="outline-4">
<h4 id="org00f1b9e"><span class="section-number-4">1.4.2.</span> semaine.c</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
Ce fichier contient la déclaration de la structure semaine (défini plus tôt)
ainsi que toutes les fonctions se rapportant à celle-ci. On a exactement les
mêmes fonctions que celle vu précédemment pour les actions, même cette fois-ci
pour les semaines, ainsi que quelques fonctions supplémentaires provenant du
faites que les actions vont partie intégrante des semaines. On a donc en plus
des fonctions pour chercher, supprimer ou insérer des actions dans une liste
de semaine.
</p>
</div>
</div>


<div id="outline-container-orgd0bc490" class="outline-4">
<h4 id="orgd0bc490"><span class="section-number-4">1.4.3.</span> menu.c</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
Ce fichier contient Le menu afin de gérer de façon clair et simplifier la
gestion de notre calendrier, c'est notamment dans ce fichier que tous ce qui
concerne la lecture ou écriture du calendrier depuis un fichier et faite.
Pour le compiler il suffit d'utiliser la commande make afin d'appeler le
makefile (cf : makefile).
</p>
</div>
</div>


<div id="outline-container-org6b93782" class="outline-4">
<h4 id="org6b93782"><span class="section-number-4">1.4.4.</span> test.c</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Ce fichier contiens tous les jeux de tests afin de vérifier que nos
différentes fonctions produisent bien le résultat escompté. Pour le compiler
il suffit d'appeler le makefile avec comme argument test (cf : makefile) 
</p>
</div>
</div>
</div>
</div>
