tp1/compte_rendu.org
* Fonctions
  
  Afin d'avoir une explication générale des fonction, de leurs paramètres et de
  leur sortie, un bloc de commentaire est déjà présent dans chaque headers. Cette
  section s'intéresse plus au corps des fonctions et explique l'algorithme ainsi
  que les différentes notations de celle-ci.
  
** Fonctions actions

*** Sous procédures

**** checkDay

     CheckDay est une fonction présente pour simplifier la vérification et
     rendre plus lisible les conditions dans les autres fonctions. Elle vérifie
     seulement si le jour donné en argument *day* et cohérent.
     
     #+BEGIN_SRC c
  int checkDay(char day) { return (day > '0' && day < '7'); }
#+END_SRC

     
**** checkHour

     CheckHour est exactement la même fonction que checkDay mais pour les heures
          #+BEGIN_SRC c
  int checkHour(char hour[2]) {
  return strcmp(hour, "00") >= 0 && strcmp(hour, "24") <= 0;
}
#+END_SRC


**** compareAction
     Compare action va comme indiquer dans le bloc de commentaire renvoyer 1 si
     l'action donné en argument *act* viens avant où est égal chronologiquement avec la date
     de référence *day* et *hour*.
          #+BEGIN_SRC c
  int compareAction(action_t *act, char day, char hour[2]) {
  return act->day < day || (act->day == day && strcmp(act->hour, hour) < 0);
}
#+END_SRC


**** equalAction
     EqualAction se comporte comme compareAction, mais cette fois ci elle
     renvoie vrai seulement si *act* est égale à *day* et *hour*
          #+BEGIN_SRC c
  int equalAction(action_t *a, char day, char hour[2]) {
  return a->day == day && strcmp(a->hour, hour) == 0;
}
#+END_SRC

     


*** Procédures

**** initListAction

     initListAction renvoie seulement NULL, on effet vu que notre liste est une
     tête réelle, si notre liste est vide, on à donc notre tête qui pointe sur
     rien.
     
     #+BEGIN_SRC c 
  listAction_t initListAction() { return NULL; }
#+END_SRC
>


