calendar/compte_rendu.html


<div id="outline-container-org37ef291" class="outline-2">
<h2 id="org37ef291"><span class="section-number-2">2.</span> Fonctions</h2>
<div class="outline-text-2" id="text-2">
<p>
Afin d'avoir une explication générale des fonction, de leurs paramètres et de
leur sortie, un bloc de commentaire est déjà présent dans chaque headers. Cette
section s'intéresse plus au corps des fonctions et explique l'algorithme ainsi
que les différentes notations de celle-ci.
</p>
</div>

<div id="outline-container-org5e1b509" class="outline-3">
<h3 id="org5e1b509"><span class="section-number-3">2.1.</span> Fonctions actions</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org5853d31" class="outline-4">
<h4 id="org5853d31"><span class="section-number-4">2.1.1.</span> Sous procédures</h4>
<div class="outline-text-4" id="text-2-1-1">
</div>
<ol class="org-ol">
<li><a id="orgb6b0439"></a>checkDay<br />
<div class="outline-text-5" id="text-2-1-1-1">
<p>
CheckDay est une fonction présente pour simplifier la vérification et
rendre plus lisible les conditions dans les autres fonctions. Elle vérifie
seulement si le jour donné en argument <b>day</b> et cohérent.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #7392E5;">int</span> <span style="color: #E9D2AF;">checkDay</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">day</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span> <span style="color: #6E8EE5;">return</span> <span style="color: #93a8c6;">(</span>day &gt; <span style="color: #C27127;">'0'</span> &amp;&amp; day &lt; <span style="color: #C27127;">'7'</span><span style="color: #93a8c6;">)</span>; <span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="orgcf137c1"></a>checkHour<br />
<div class="outline-text-5" id="text-2-1-1-2">
<p>
CheckHour est exactement la même fonction que checkDay mais pour les heures
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">int</span> <span style="color: #E9D2AF;">checkHour</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">hour</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #6E8EE5;">return</span> strcmp<span style="color: #93a8c6;">(</span>hour, <span style="color: #C27127;">"00"</span><span style="color: #93a8c6;">)</span> &gt;= 0 &amp;&amp; strcmp<span style="color: #93a8c6;">(</span>hour, <span style="color: #C27127;">"24"</span><span style="color: #93a8c6;">)</span> &lt;= 0;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="org129608a"></a>compareAction<br />
<div class="outline-text-5" id="text-2-1-1-3">
<p>
Compare action va comme indiquer dans le bloc de commentaire renvoyer 1 si
l'action donné en argument <b>act</b> viens avant où est égal chronologiquement avec la date
de référence <b>day</b> et <b>hour</b>.
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">int</span> <span style="color: #E9D2AF;">compareAction</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">action_t</span> *<span style="color: #CBD4EA;">act</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">day</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">hour</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #6E8EE5;">return</span> act-&gt;day &lt; day || <span style="color: #93a8c6;">(</span>act-&gt;day == day &amp;&amp; strcmp<span style="color: #b0b1a3;">(</span>act-&gt;hour, hour<span style="color: #b0b1a3;">)</span> &lt; 0<span style="color: #93a8c6;">)</span>;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="org4c66874"></a>equalAction<br />
<div class="outline-text-5" id="text-2-1-1-4">
<p>
EqualAction se comporte comme compareAction, mais cette fois ci elle
renvoie vrai seulement si <b>act</b> est égale à <b>day</b> et <b>hour</b>
</p>
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">int</span> <span style="color: #E9D2AF;">equalAction</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">action_t</span> *<span style="color: #CBD4EA;">a</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">day</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">hour</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #6E8EE5;">return</span> a-&gt;day == day &amp;&amp; strcmp<span style="color: #93a8c6;">(</span>a-&gt;hour, hour<span style="color: #93a8c6;">)</span> == 0;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>
</ol>
</div>




<div id="outline-container-org750b61e" class="outline-4">
<h4 id="org750b61e"><span class="section-number-4">2.1.2.</span> Procédures</h4>
<div class="outline-text-4" id="text-2-1-2">
</div>
<ol class="org-ol">
<li><a id="orged109df"></a>initListAction<br />
<div class="outline-text-5" id="text-2-1-2-1">
<p>
initListAction renvoie seulement NULL, on effet vu que notre liste est une
tête réelle, si notre liste est vide, on à donc notre tête qui pointe sur
rien.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #7392E5;">listAction_t</span> <span style="color: #E9D2AF;">initListAction</span><span style="color: #8c8c8c;">()</span> <span style="color: #8c8c8c;">{</span> <span style="color: #6E8EE5;">return</span> <span style="color: #5971B2;">NULL</span>; <span style="color: #8c8c8c;">}</span>
</pre>
</div>
<p>
&gt;
</p>
</div>
</li>
