tp1/compte_rendu.org
**** newAction

     Le but de newAction est de créer une action à partir des informations
     nécessaires
     (*day*, *hour* et *name*)
     Dans un premier temps on va regarder si les informations fournit sont
     cohérentes, en effet si elle ne le sont pas rien ne sert de continuer et en
     renvoie dans ce cas NULL (et un message pour préciser à l'utilisateur le
     problème).
     Cette fonction va ensuite allouer l'espace mémoire nécessaire pour une
     action si les informations sont cohérentes. Si on à une erreur lors de
     l'allocation on envoie un message d'erreur à l'utilisateur et on arrête le
     processus (si il y a une erreur pour une allocation, il y a de grande
     chance qu'un plus gros problème est en train de se produire).

     #+BEGIN_SRC c
  action_t *newAction(char day, char hour[2], char name[10]) {
  action_t *nouv = NULL;

  // Si tout est correcte, on alloue l'espace mémoire nécessaire
  // Sinon on renvoie NULL;
  if (checkHour(hour) && checkDay(day)) {
    if ((nouv = (action_t *)malloc(sizeof(action_t)))) {
      nouv->day = day;
      strcpy(nouv->hour, hour);
      strncpy(nouv->name, name, 10);
      nouv->suiv = NULL;
    } else {
      printf("ERROR ALLOC DOESN'T WORK");
      exit(-1);
    }
  } else {
    printf("INVALID HOUR OR DAY\n");
  }
  return nouv;
}
#+END_SRC


**** freeAction

     Dans le cas d'une simple action, il suffit juste de free cette dernière
     (cette fonction est surtout là car c'est une fonction que l'on doit créer
     pour de nombreux SDD).

     #+BEGIN_SRC c
  void freeAction(action_t *act) { free(act); }
#+END_SRC


**** freeListAction
     Cette fonction va libérer une liste d'action (en O(n), n étant la taille
     de la liste)

     #+BEGIN_SRC c
  void freeListAction(listAction_t listAct) {
  action_t *curr = listAct; // Un pointeur vers notre action actuelle
  action_t *tmp;            // Action temporaire (celle qu'on va supprimer)

  // On supprime la tête de liste et on avance jusqu'à arriver à la fin
  while (curr) {
    tmp = curr;
    curr = curr->suiv;
    freeAction(tmp);
  }
}
#+END_SRC


