calendar/compte_rendu.html


<li><a id="org9e51535"></a>newAction<br />
<div class="outline-text-5" id="text-2-1-2-2">
<p>
Le but de newAction est de créer une action à partir des informations
nécessaires
(<b>day</b>, <b>hour</b> et <b>name</b>)
Dans un premier temps on va regarder si les informations fournit sont
cohérentes, en effet si elle ne le sont pas rien ne sert de continuer et en
renvoie dans ce cas NULL (et un message pour préciser à l'utilisateur le
problème).
Cette fonction va ensuite allouer l'espace mémoire nécessaire pour une
action si les informations sont cohérentes. Si on à une erreur lors de
l'allocation on envoie un message d'erreur à l'utilisateur et on arrête le
processus (si il y a une erreur pour une allocation, il y a de grande
chance qu'un plus gros problème est en train de se produire).
</p>

<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">action_t</span> *<span style="color: #E9D2AF;">newAction</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">day</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">hour</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">name</span><span style="color: #93a8c6;">[</span>10<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #7392E5;">action_t</span> *<span style="color: #CBD4EA;">nouv</span> = <span style="color: #5971B2;">NULL</span>;

  <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Si tout est correcte, on alloue l'espace m&#233;moire n&#233;cessaire</span>
  <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Sinon on renvoie NULL;</span>
  <span style="color: #6E8EE5;">if</span> <span style="color: #93a8c6;">(</span>checkHour<span style="color: #b0b1a3;">(</span>hour<span style="color: #b0b1a3;">)</span> &amp;&amp; checkDay<span style="color: #b0b1a3;">(</span>day<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #6E8EE5;">if</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>nouv = <span style="color: #aebed8;">(</span><span style="color: #7392E5;">action_t</span> *<span style="color: #aebed8;">)</span>malloc<span style="color: #aebed8;">(</span><span style="color: #6E8EE5;">sizeof</span><span style="color: #b0b0b3;">(</span>action_t<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">{</span>
      nouv-&gt;day = day;
      strcpy<span style="color: #97b098;">(</span>nouv-&gt;hour, hour<span style="color: #97b098;">)</span>;
      strncpy<span style="color: #97b098;">(</span>nouv-&gt;name, name, 10<span style="color: #97b098;">)</span>;
      nouv-&gt;suiv = <span style="color: #5971B2;">NULL</span>;
    <span style="color: #b0b1a3;">}</span> <span style="color: #6E8EE5;">else</span> <span style="color: #b0b1a3;">{</span>
      printf<span style="color: #97b098;">(</span><span style="color: #C27127;">"ERROR ALLOC DOESN'T WORK"</span><span style="color: #97b098;">)</span>;
      exit<span style="color: #97b098;">(</span>-1<span style="color: #97b098;">)</span>;
    <span style="color: #b0b1a3;">}</span>
  <span style="color: #93a8c6;">}</span> <span style="color: #6E8EE5;">else</span> <span style="color: #93a8c6;">{</span>
    printf<span style="color: #b0b1a3;">(</span><span style="color: #C27127;">"INVALID HOUR OR DAY\n"</span><span style="color: #b0b1a3;">)</span>;
  <span style="color: #93a8c6;">}</span>
  <span style="color: #6E8EE5;">return</span> nouv;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="org72a1691"></a>freeAction<br />
<div class="outline-text-5" id="text-2-1-2-3">
<p>
Dans le cas d'une simple action, il suffit juste de free cette dernière
(cette fonction est surtout là car c'est une fonction que l'on doit créer
pour de nombreux SDD).
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #7392E5;">void</span> <span style="color: #E9D2AF;">freeAction</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">action_t</span> *<span style="color: #CBD4EA;">act</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span> free<span style="color: #93a8c6;">(</span>act<span style="color: #93a8c6;">)</span>; <span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="orga023be0"></a>freeListAction<br />
<div class="outline-text-5" id="text-2-1-2-4">
<p>
Cette fonction va libérer une liste d'action (en O(n), n étant la taille
de la liste)
</p>

<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">void</span> <span style="color: #E9D2AF;">freeListAction</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">listAction_t</span> <span style="color: #CBD4EA;">listAct</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #7392E5;">action_t</span> *<span style="color: #CBD4EA;">curr</span> = listAct; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Un pointeur vers notre action actuelle</span>
  <span style="color: #7392E5;">action_t</span> *<span style="color: #CBD4EA;">tmp</span>;            <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Action temporaire (celle qu'on va supprimer)</span>

  <span style="color: #656C7D;">// </span><span style="color: #656C7D;">On supprime la t&#234;te de liste et on avance jusqu'&#224; arriver &#224; la fin</span>
  <span style="color: #6E8EE5;">while</span> <span style="color: #93a8c6;">(</span>curr<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
    tmp = curr;
    curr = curr-&gt;suiv;
    freeAction<span style="color: #b0b1a3;">(</span>tmp<span style="color: #b0b1a3;">)</span>;
  <span style="color: #93a8c6;">}</span>
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>
