tp1/compte_rendu.org
**** findAction
     Cette fonction va chercher dans une liste chaînée rangée la cellule
     correspondante et ceux et ce servant de l'algorithme vu en SDD. Elle
     retournera un pointeur qui pointe vers un pointeur d'action. Ce dernier
     contient l'action précédent celle recherché si elle existe dans la liste,
     sinon elle renverra le précédent de l'action la plus petite tel qu'elle
     soit plus grande que l'action recherchée. Dans le cas où les informations
     fournis sont incohérentes. On ne prends même pas la peine de chercher et on
     renvoie directement NULL.

     #+BEGIN_SRC c
   action_t **findAction(listAction_t *listAct, char hour[2], char day) {
  action_t **prec =
      NULL; // Pointeur d'un pointeur contenant l'action précédente
  if (checkHour(hour) && checkDay(day)) {
    prec = listAct;
    action_t *curr = *listAct; // Un pointeur vers notre action actuelle

    // Tant qu'on n'as pas trouvé l'action voulue et qu'on est avant
    // chronologiquement
    while (curr && compareAction(curr, day, hour)) {
      prec = &(curr->suiv);
      curr = curr->suiv;
    }
  }
  return prec;
}
#+END_SRC


**** insertAction

     Cette fonction va insérer dans une liste d'action une action si celle-ci
     est cohérente et si il n'existe pas déjà dans la liste une action avec le
     même jour et la même heure.
     Cette dernière suit la même logique que l'algorithme vu en SDD et ce sert
     de la fonction findAction décrite précédemment.

     #+BEGIN_SRC c
  void insertAction(listAction_t *listAct, action_t *nouvAction) {

  // Si notre nouvAction n'est pas correcte, pas besoin de l'ajouter
  if (nouvAction != NULL) {

    // Pointeur de pointeur d'action qui pointe vers l'action précédent celle
    // voulue si elle existe sinon voir fonction findAction
    action_t **prec = findAction(listAct, nouvAction->hour, nouvAction->day);

    // Si une action existe déjà avec ce jour et heure
    // On ne l'ajoute pas, et on le libère de la mémoire
    if ((*prec) != NULL &&
        equalAction(*prec, nouvAction->day, nouvAction->hour)) {
      printf("WE ALREADY HAVE AN ACTION AT THIS HOUR AND DAY OF THE WEEK\n");
      freeAction(nouvAction);

    }
    // Sinon on l'ajoute dans notre liste
    else {
      nouvAction->suiv = (*prec);
      *prec = nouvAction;
    }
  }
}
#+END_SRC


