calendar/compte_rendu.html


<li><a id="orgc0d3c9c"></a>findAction<br />
<div class="outline-text-5" id="text-2-1-2-5">
<p>
Cette fonction va chercher dans une liste chaînée rangée la cellule
correspondante et ceux et ce servant de l'algorithme vu en SDD. Elle
retournera un pointeur qui pointe vers un pointeur d'action. Ce dernier
contient l'action précédent celle recherché si elle existe dans la liste,
sinon elle renverra le précédent de l'action la plus petite tel qu'elle
soit plus grande que l'action recherchée. Dans le cas où les informations
fournis sont incohérentes. On ne prends même pas la peine de chercher et on
renvoie directement NULL.
</p>

<div class="org-src-container">
<pre class="src src-c">   <span style="color: #7392E5;">action_t</span> **<span style="color: #E9D2AF;">findAction</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">listAction_t</span> *<span style="color: #CBD4EA;">listAct</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">hour</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">day</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #7392E5;">action_t</span> **<span style="color: #CBD4EA;">prec</span> =
      <span style="color: #5971B2;">NULL</span>; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Pointeur d'un pointeur contenant l'action pr&#233;c&#233;dente</span>
  <span style="color: #6E8EE5;">if</span> <span style="color: #93a8c6;">(</span>checkHour<span style="color: #b0b1a3;">(</span>hour<span style="color: #b0b1a3;">)</span> &amp;&amp; checkDay<span style="color: #b0b1a3;">(</span>day<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
    prec = listAct;
    <span style="color: #7392E5;">action_t</span> *<span style="color: #CBD4EA;">curr</span> = *listAct; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Un pointeur vers notre action actuelle</span>

    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Tant qu'on n'as pas trouv&#233; l'action voulue et qu'on est avant</span>
    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">chronologiquement</span>
    <span style="color: #6E8EE5;">while</span> <span style="color: #b0b1a3;">(</span>curr &amp;&amp; compareAction<span style="color: #97b098;">(</span>curr, day, hour<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">{</span>
      prec = &amp;<span style="color: #97b098;">(</span>curr-&gt;suiv<span style="color: #97b098;">)</span>;
      curr = curr-&gt;suiv;
    <span style="color: #b0b1a3;">}</span>
  <span style="color: #93a8c6;">}</span>
  <span style="color: #6E8EE5;">return</span> prec;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="org3c9d0d0"></a>insertAction<br />
<div class="outline-text-5" id="text-2-1-2-6">
<p>
Cette fonction va insérer dans une liste d'action une action si celle-ci
est cohérente et si il n'existe pas déjà dans la liste une action avec le
même jour et la même heure.
Cette dernière suit la même logique que l'algorithme vu en SDD et ce sert
de la fonction findAction décrite précédemment.
</p>

<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">void</span> <span style="color: #E9D2AF;">insertAction</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">listAction_t</span> *<span style="color: #CBD4EA;">listAct</span>, <span style="color: #7392E5;">action_t</span> *<span style="color: #CBD4EA;">nouvAction</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>

  <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Si notre nouvAction n'est pas correcte, pas besoin de l'ajouter</span>
  <span style="color: #6E8EE5;">if</span> <span style="color: #93a8c6;">(</span>nouvAction != <span style="color: #5971B2;">NULL</span><span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>

    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Pointeur de pointeur d'action qui pointe vers l'action pr&#233;c&#233;dent celle</span>
    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">voulue si elle existe sinon voir fonction findAction</span>
    <span style="color: #7392E5;">action_t</span> **<span style="color: #CBD4EA;">prec</span> = findAction<span style="color: #b0b1a3;">(</span>listAct, nouvAction-&gt;hour, nouvAction-&gt;day<span style="color: #b0b1a3;">)</span>;

    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Si une action existe d&#233;j&#224; avec ce jour et heure</span>
    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">On ne l'ajoute pas, et on le lib&#232;re de la m&#233;moire</span>
    <span style="color: #6E8EE5;">if</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>*prec<span style="color: #97b098;">)</span> != <span style="color: #5971B2;">NULL</span> &amp;&amp;
        equalAction<span style="color: #97b098;">(</span>*prec, nouvAction-&gt;day, nouvAction-&gt;hour<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">{</span>
      printf<span style="color: #97b098;">(</span><span style="color: #C27127;">"WE ALREADY HAVE AN ACTION AT THIS HOUR AND DAY OF THE WEEK\n"</span><span style="color: #97b098;">)</span>;
      freeAction<span style="color: #97b098;">(</span>nouvAction<span style="color: #97b098;">)</span>;

    <span style="color: #b0b1a3;">}</span>
    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Sinon on l'ajoute dans notre liste</span>
    <span style="color: #6E8EE5;">else</span> <span style="color: #b0b1a3;">{</span>
      nouvAction-&gt;suiv = <span style="color: #97b098;">(</span>*prec<span style="color: #97b098;">)</span>;
      *prec = nouvAction;
    <span style="color: #b0b1a3;">}</span>
  <span style="color: #93a8c6;">}</span>
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>
