tp1/compte_rendu.org
**** supprAction

     cette fonction va supprimer une action fournie en argument dans une liste
     d'action
     (si elle est dedans, sinon ne fais rien)
     On vérifie toujours que ce que l'on veut supprimer est cohérent, sinon on à
     même pas besoin de chercher.

     #+BEGIN_SRC c
  void supprAction(listAction_t *listAct, char hour[2], char day) {

  if (checkHour(hour) && checkDay(day)) {
    action_t **pprec =
        findAction(listAct, hour, day); // Comme dans insertAction

    // Si on a bien cette action dans note liste
    if (pprec != NULL && *pprec != NULL && equalAction(*pprec, day, hour)) {

      action_t *tmp = *pprec; // Action temporaire
      (*pprec) = (*pprec)->suiv;
      freeAction(tmp);
    }
  }
}
#+END_SRC


**** prettyPrintListAction

     Une fonction afin de visualiser plus joliment le contenue de notre
     liste.
     On aurait aussi pu faire un prettyPrintAction et ensuite appeler cette
     fonction pour toutes les action de la Liste, cependant cette fonction ne
     nous aurait pas plus servi que ça.


** Fonctions semaines

   La plupart des fonctions propres au semaine suivent les mêmes algorithmes que
   ceux vu précédemment avec les actions, il y a juste un changement, *day*
   et *hour* deviennent *numWeek* et *year*. C'est pour ça que l'on ne va pas
   les décrire entièrement. Seul insertActionInsideWeek et supprActionInsideWeek
   sont différents de ce que l'on à vu dans action.

*** Sous procédures

**** checkYear (similaire à checkHour)

     #+BEGIN_SRC c
  int checkYear(char year[4]) {
  return strcmp(year, "0000") >= 0 && strcmp(year, "9999") <= 0;
}
#+END_SRC


**** checkNumWeek (similaire à checkHour)

     #+BEGIN_SRC c
  int checkNumWeek(char numWeek[2]) {
  return strcmp(numWeek, "00") >= 0 && strcmp(numWeek, "52") <= 0;
}
#+END_SRC


**** compareWeek (similaire à compareAction)

     #+BEGIN_SRC c
  int compareWeek(week_t *week, char year[4], char numWeek[2]) {
  return strcmp(week->year, year) < 0 || (strcmp(week->year, year) == 0 &&
                                          (strcmp(week->numWeek, numWeek) < 0));
}
#+END_SRC


**** equalWeek (similaire à equalWeek)

     #+BEGIN_SRC c
  int equalWeek(week_t *week, char year[4], char numWeek[2]) {
  return strcmp(week->year, year) == 0 && strcmp(week->numWeek, numWeek) == 0;
}

#+END_SRC


*** Procedures

