calendar/compte_rendu.html


<li><a id="org5a9afdd"></a>supprAction<br />
<div class="outline-text-5" id="text-2-1-2-7">
<p>
cette fonction va supprimer une action fournie en argument dans une liste
d'action
(si elle est dedans, sinon ne fais rien)
On vérifie toujours que ce que l'on veut supprimer est cohérent, sinon on à
même pas besoin de chercher.
</p>

<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">void</span> <span style="color: #E9D2AF;">supprAction</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">listAction_t</span> *<span style="color: #CBD4EA;">listAct</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">hour</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">day</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>

  <span style="color: #6E8EE5;">if</span> <span style="color: #93a8c6;">(</span>checkHour<span style="color: #b0b1a3;">(</span>hour<span style="color: #b0b1a3;">)</span> &amp;&amp; checkDay<span style="color: #b0b1a3;">(</span>day<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #7392E5;">action_t</span> **<span style="color: #CBD4EA;">pprec</span> =
        findAction<span style="color: #b0b1a3;">(</span>listAct, hour, day<span style="color: #b0b1a3;">)</span>; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Comme dans insertAction</span>

    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Si on a bien cette action dans note liste</span>
    <span style="color: #6E8EE5;">if</span> <span style="color: #b0b1a3;">(</span>pprec != <span style="color: #5971B2;">NULL</span> &amp;&amp; *pprec != <span style="color: #5971B2;">NULL</span> &amp;&amp; equalAction<span style="color: #97b098;">(</span>*pprec, day, hour<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">{</span>

      <span style="color: #7392E5;">action_t</span> *<span style="color: #CBD4EA;">tmp</span> = *pprec; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Action temporaire</span>
      <span style="color: #97b098;">(</span>*pprec<span style="color: #97b098;">)</span> = <span style="color: #97b098;">(</span>*pprec<span style="color: #97b098;">)</span>-&gt;suiv;
      freeAction<span style="color: #97b098;">(</span>tmp<span style="color: #97b098;">)</span>;
    <span style="color: #b0b1a3;">}</span>
  <span style="color: #93a8c6;">}</span>
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="org0370056"></a>prettyPrintListAction<br />
<div class="outline-text-5" id="text-2-1-2-8">
<p>
Une fonction afin de visualiser plus joliment le contenue de notre
liste.
On aurait aussi pu faire un prettyPrintAction et ensuite appeler cette
fonction pour toutes les action de la Liste, cependant cette fonction ne
nous aurait pas plus servi que ça.
</p>
</div>
</li>
</ol>
</div>
</div>


<div id="outline-container-org3b09a5f" class="outline-3">
<h3 id="org3b09a5f"><span class="section-number-3">2.2.</span> Fonctions semaines</h3>
<div class="outline-text-3" id="text-2-2">
<p>
La plupart des fonctions propres au semaine suivent les mêmes algorithmes que
ceux vu précédemment avec les actions, il y a juste un changement, <b>day</b>
et <b>hour</b> deviennent <b>numWeek</b> et <b>year</b>. C'est pour ça que l'on ne va pas
les décrire entièrement. Seul insertActionInsideWeek et supprActionInsideWeek
sont différents de ce que l'on à vu dans action.
</p>
</div>

<div id="outline-container-orgb602ebb" class="outline-4">
<h4 id="orgb602ebb"><span class="section-number-4">2.2.1.</span> Sous procédures</h4>
<div class="outline-text-4" id="text-2-2-1">
</div>
<ol class="org-ol">
<li><a id="orgf04afe1"></a>checkYear (similaire à checkHour)<br />
<div class="outline-text-5" id="text-2-2-1-1">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">int</span> <span style="color: #E9D2AF;">checkYear</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">year</span><span style="color: #93a8c6;">[</span>4<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #6E8EE5;">return</span> strcmp<span style="color: #93a8c6;">(</span>year, <span style="color: #C27127;">"0000"</span><span style="color: #93a8c6;">)</span> &gt;= 0 &amp;&amp; strcmp<span style="color: #93a8c6;">(</span>year, <span style="color: #C27127;">"9999"</span><span style="color: #93a8c6;">)</span> &lt;= 0;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="org0fe7bc9"></a>checkNumWeek (similaire à checkHour)<br />
<div class="outline-text-5" id="text-2-2-1-2">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">int</span> <span style="color: #E9D2AF;">checkNumWeek</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">numWeek</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #6E8EE5;">return</span> strcmp<span style="color: #93a8c6;">(</span>numWeek, <span style="color: #C27127;">"00"</span><span style="color: #93a8c6;">)</span> &gt;= 0 &amp;&amp; strcmp<span style="color: #93a8c6;">(</span>numWeek, <span style="color: #C27127;">"52"</span><span style="color: #93a8c6;">)</span> &lt;= 0;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="orgd01cbd5"></a>compareWeek (similaire à compareAction)<br />
<div class="outline-text-5" id="text-2-2-1-3">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">int</span> <span style="color: #E9D2AF;">compareWeek</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">week_t</span> *<span style="color: #CBD4EA;">week</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">year</span><span style="color: #93a8c6;">[</span>4<span style="color: #93a8c6;">]</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">numWeek</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #6E8EE5;">return</span> strcmp<span style="color: #93a8c6;">(</span>week-&gt;year, year<span style="color: #93a8c6;">)</span> &lt; 0 || <span style="color: #93a8c6;">(</span>strcmp<span style="color: #b0b1a3;">(</span>week-&gt;year, year<span style="color: #b0b1a3;">)</span> == 0 &amp;&amp;
                                          <span style="color: #b0b1a3;">(</span>strcmp<span style="color: #97b098;">(</span>week-&gt;numWeek, numWeek<span style="color: #97b098;">)</span> &lt; 0<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span>;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="org1023e22"></a>equalWeek (similaire à equalWeek)<br />
<div class="outline-text-5" id="text-2-2-1-4">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">int</span> <span style="color: #E9D2AF;">equalWeek</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">week_t</span> *<span style="color: #CBD4EA;">week</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">year</span><span style="color: #93a8c6;">[</span>4<span style="color: #93a8c6;">]</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">numWeek</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #6E8EE5;">return</span> strcmp<span style="color: #93a8c6;">(</span>week-&gt;year, year<span style="color: #93a8c6;">)</span> == 0 &amp;&amp; strcmp<span style="color: #93a8c6;">(</span>week-&gt;numWeek, numWeek<span style="color: #93a8c6;">)</span> == 0;
<span style="color: #8c8c8c;">}</span>

</pre>
</div>
</div>
</li>
</ol>
</div>
