tp1/compte_rendu.org
**** initListWeek(similaire à initListAction)

     #+BEGIN_SRC c
  listWeek_t initListWeek() { return NULL; }
#+END_SRC

     
**** newWeek (similaire à newAction)

     #+BEGIN_SRC c
  week_t *newWeek(char year[4], char numWeek[2]) {
  week_t *nouv = NULL; // La nouvelle semaine alloué (null si incorrect)

  // Si nos arguments sont cohérents
  if (checkYear(year) && checkNumWeek(numWeek)) {

    // Si l'allocation c'est bien passé
    if ((nouv = (week_t *)malloc(sizeof(week_t)))) {
      strcpy(nouv->year, year);
      strcpy(nouv->numWeek, numWeek);
      nouv->suiv = NULL;
      nouv->listAct = initListAction();
    } else {
      printf("ERROR ALLOC DOESN'T WORK");
      exit(-1);
    }
  } else {
    printf("INVALID YEAR OR WEEK\n");
  }

  return nouv;
}
#+END_SRC


**** freeWeek

     Il faut faire attention car dans freeWeek, on doit bien entendu libérer la
     place qu'on à utilisé pour la semaine mais avant cela bien penser à
     supprimer toute la place prise par notre liste d'action.

     #+BEGIN_SRC c
  void freeWeek(week_t *week) {
  freeListAction(week->listAct); // On libère en premier la liste d'action
  free(week);                    // Puis la semaine en elle même
}

#+END_SRC


**** freeListWeek (similaire à freeListAction)

     #+BEGIN_SRC c
  void freeListWeek(listWeek_t week) {
  week_t *curr = week; // Un pointeur vers la semaine actuelle
  week_t *tmp;         // Un pointeur de semaine temporaire
  while (curr) {
    tmp = curr;
    curr = curr->suiv;
    freeWeek(tmp);
  }
}
#+END_SRC


