calendar/compte_rendu.html


<div id="outline-container-org350c06a" class="outline-4">
<h4 id="org350c06a"><span class="section-number-4">2.2.2.</span> Procedures</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
<ol class="org-ol">
<li><a id="org047f491"></a>initListWeek(similaire à initListAction)<br />
<div class="outline-text-5" id="text-2-2-2-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #7392E5;">listWeek_t</span> <span style="color: #E9D2AF;">initListWeek</span><span style="color: #8c8c8c;">()</span> <span style="color: #8c8c8c;">{</span> <span style="color: #6E8EE5;">return</span> <span style="color: #5971B2;">NULL</span>; <span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="org6cfed67"></a>newWeek (similaire à newAction)<br />
<div class="outline-text-5" id="text-2-2-2-2">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">week_t</span> *<span style="color: #E9D2AF;">newWeek</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">year</span><span style="color: #93a8c6;">[</span>4<span style="color: #93a8c6;">]</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">numWeek</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #7392E5;">week_t</span> *<span style="color: #CBD4EA;">nouv</span> = <span style="color: #5971B2;">NULL</span>; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">La nouvelle semaine allou&#233; (null si incorrect)</span>

  <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Si nos arguments sont coh&#233;rents</span>
  <span style="color: #6E8EE5;">if</span> <span style="color: #93a8c6;">(</span>checkYear<span style="color: #b0b1a3;">(</span>year<span style="color: #b0b1a3;">)</span> &amp;&amp; checkNumWeek<span style="color: #b0b1a3;">(</span>numWeek<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>

    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Si l'allocation c'est bien pass&#233;</span>
    <span style="color: #6E8EE5;">if</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>nouv = <span style="color: #aebed8;">(</span><span style="color: #7392E5;">week_t</span> *<span style="color: #aebed8;">)</span>malloc<span style="color: #aebed8;">(</span><span style="color: #6E8EE5;">sizeof</span><span style="color: #b0b0b3;">(</span>week_t<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span><span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">{</span>
      strcpy<span style="color: #97b098;">(</span>nouv-&gt;year, year<span style="color: #97b098;">)</span>;
      strcpy<span style="color: #97b098;">(</span>nouv-&gt;numWeek, numWeek<span style="color: #97b098;">)</span>;
      nouv-&gt;suiv = <span style="color: #5971B2;">NULL</span>;
      nouv-&gt;listAct = initListAction<span style="color: #97b098;">()</span>;
    <span style="color: #b0b1a3;">}</span> <span style="color: #6E8EE5;">else</span> <span style="color: #b0b1a3;">{</span>
      printf<span style="color: #97b098;">(</span><span style="color: #C27127;">"ERROR ALLOC DOESN'T WORK"</span><span style="color: #97b098;">)</span>;
      exit<span style="color: #97b098;">(</span>-1<span style="color: #97b098;">)</span>;
    <span style="color: #b0b1a3;">}</span>
  <span style="color: #93a8c6;">}</span> <span style="color: #6E8EE5;">else</span> <span style="color: #93a8c6;">{</span>
    printf<span style="color: #b0b1a3;">(</span><span style="color: #C27127;">"INVALID YEAR OR WEEK\n"</span><span style="color: #b0b1a3;">)</span>;
  <span style="color: #93a8c6;">}</span>

  <span style="color: #6E8EE5;">return</span> nouv;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="org89b1f5c"></a>freeWeek<br />
<div class="outline-text-5" id="text-2-2-2-3">
<p>
Il faut faire attention car dans freeWeek, on doit bien entendu libérer la
place qu'on à utilisé pour la semaine mais avant cela bien penser à
supprimer toute la place prise par notre liste d'action.
</p>

<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">void</span> <span style="color: #E9D2AF;">freeWeek</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">week_t</span> *<span style="color: #CBD4EA;">week</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  freeListAction<span style="color: #93a8c6;">(</span>week-&gt;listAct<span style="color: #93a8c6;">)</span>; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">On lib&#232;re en premier la liste d'action</span>
  free<span style="color: #93a8c6;">(</span>week<span style="color: #93a8c6;">)</span>;                    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Puis la semaine en elle m&#234;me</span>
<span style="color: #8c8c8c;">}</span>

</pre>
</div>
</div>
</li>


<li><a id="org0ba2b45"></a>freeListWeek (similaire à freeListAction)<br />
<div class="outline-text-5" id="text-2-2-2-4">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">void</span> <span style="color: #E9D2AF;">freeListWeek</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">listWeek_t</span> <span style="color: #CBD4EA;">week</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #7392E5;">week_t</span> *<span style="color: #CBD4EA;">curr</span> = week; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Un pointeur vers la semaine actuelle</span>
  <span style="color: #7392E5;">week_t</span> *<span style="color: #CBD4EA;">tmp</span>;         <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Un pointeur de semaine temporaire</span>
  <span style="color: #6E8EE5;">while</span> <span style="color: #93a8c6;">(</span>curr<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
    tmp = curr;
    curr = curr-&gt;suiv;
    freeWeek<span style="color: #b0b1a3;">(</span>tmp<span style="color: #b0b1a3;">)</span>;
  <span style="color: #93a8c6;">}</span>
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>
