tp1/compte_rendu.org
**** findWeek (similaire à findAction)
     
     #+BEGIN_SRC c
  week_t **findWeek(listWeek_t *listWeek, char year[4], char numWeek[2]) {
  week_t **prec = NULL; // Un pointeur de pointeur de semaine pointant vers la
                        // semaine précédent celle recherche si elle existe
                        // (sinon : voir bloc de commentaires dans le header)

  // Si nos argument sont correctes
  if (checkYear(year) && checkNumWeek(numWeek)) {
    week_t *curr = *listWeek; // pointeur vers la semaine actuelle
    prec = listWeek;

    // Tant qu'on à pas trouvé la bonne semaine ou une plus grande.
    while (curr && compareWeek(curr, year, numWeek)) {
      prec = &(curr->suiv);
      curr = curr->suiv;
    }
  }
  return prec;
}
#+END_SRC


**** insertWeek (similaire à insertAction)

     #+BEGIN_SRC c
  week_t **insertWeek(listWeek_t *listWeek, week_t *nouvWeek) {
  week_t **prec; // Comme dans findWeek

  if (nouvWeek != NULL) {
    prec = findWeek(listWeek, nouvWeek->year, nouvWeek->numWeek);

    // Si il existe déjà une liste dans ce créneau.
    if ((*prec) != NULL &&
        equalWeek((*prec), nouvWeek->year, nouvWeek->numWeek)) {

      printf("THIS WEEK ALREADY EXIST, NO NEED TO ADD IT\n");

      // On libère celle en trop.
      freeWeek(nouvWeek);

    }

    // Sinon on l'ajoute
    else {
      nouvWeek->suiv = (*prec);
      *prec = nouvWeek;
    }
  }
  return prec;
}
#+END_SRC


**** supprWeek (similaire à supprAction)

     #+BEGIN_SRC c
  void supprWeek(listWeek_t *listWeek, char year[4], char week[2]) {
  week_t **pprec = findWeek(listWeek, year, week); // Comme dans findWeek

  // Si la semaine correspond bien à celle voulue
  if (pprec != NULL && *pprec != NULL && equalWeek(*pprec, year, week)) {
    // On la supprime
    week_t *tmp = *pprec; // pointeur de semaine temporaire
    (*pprec) = (*pprec)->suiv;
    freeWeek(tmp);
  }
}

#+END_SRC


