calendar/compte_rendu.html


<li><a id="org9ba5b63"></a>findWeek (similaire à findAction)<br />
<div class="outline-text-5" id="text-2-2-2-5">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">week_t</span> **<span style="color: #E9D2AF;">findWeek</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">listWeek_t</span> *<span style="color: #CBD4EA;">listWeek</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">year</span><span style="color: #93a8c6;">[</span>4<span style="color: #93a8c6;">]</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">numWeek</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #7392E5;">week_t</span> **<span style="color: #CBD4EA;">prec</span> = <span style="color: #5971B2;">NULL</span>; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Un pointeur de pointeur de semaine pointant vers la</span>
                        <span style="color: #656C7D;">// </span><span style="color: #656C7D;">semaine pr&#233;c&#233;dent celle recherche si elle existe</span>
                        <span style="color: #656C7D;">// </span><span style="color: #656C7D;">(sinon : voir bloc de commentaires dans le header)</span>

  <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Si nos argument sont correctes</span>
  <span style="color: #6E8EE5;">if</span> <span style="color: #93a8c6;">(</span>checkYear<span style="color: #b0b1a3;">(</span>year<span style="color: #b0b1a3;">)</span> &amp;&amp; checkNumWeek<span style="color: #b0b1a3;">(</span>numWeek<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #7392E5;">week_t</span> *<span style="color: #CBD4EA;">curr</span> = *listWeek; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">pointeur vers la semaine actuelle</span>
    prec = listWeek;

    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Tant qu'on &#224; pas trouv&#233; la bonne semaine ou une plus grande.</span>
    <span style="color: #6E8EE5;">while</span> <span style="color: #b0b1a3;">(</span>curr &amp;&amp; compareWeek<span style="color: #97b098;">(</span>curr, year, numWeek<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">{</span>
      prec = &amp;<span style="color: #97b098;">(</span>curr-&gt;suiv<span style="color: #97b098;">)</span>;
      curr = curr-&gt;suiv;
    <span style="color: #b0b1a3;">}</span>
  <span style="color: #93a8c6;">}</span>
  <span style="color: #6E8EE5;">return</span> prec;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="orgea3e11a"></a>insertWeek (similaire à insertAction)<br />
<div class="outline-text-5" id="text-2-2-2-6">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">week_t</span> **<span style="color: #E9D2AF;">insertWeek</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">listWeek_t</span> *<span style="color: #CBD4EA;">listWeek</span>, <span style="color: #7392E5;">week_t</span> *<span style="color: #CBD4EA;">nouvWeek</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #7392E5;">week_t</span> **<span style="color: #CBD4EA;">prec</span>; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Comme dans findWeek</span>

  <span style="color: #6E8EE5;">if</span> <span style="color: #93a8c6;">(</span>nouvWeek != <span style="color: #5971B2;">NULL</span><span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
    prec = findWeek<span style="color: #b0b1a3;">(</span>listWeek, nouvWeek-&gt;year, nouvWeek-&gt;numWeek<span style="color: #b0b1a3;">)</span>;

    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Si il existe d&#233;j&#224; une liste dans ce cr&#233;neau.</span>
    <span style="color: #6E8EE5;">if</span> <span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>*prec<span style="color: #97b098;">)</span> != <span style="color: #5971B2;">NULL</span> &amp;&amp;
        equalWeek<span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>*prec<span style="color: #aebed8;">)</span>, nouvWeek-&gt;year, nouvWeek-&gt;numWeek<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">{</span>

      printf<span style="color: #97b098;">(</span><span style="color: #C27127;">"THIS WEEK ALREADY EXIST, NO NEED TO ADD IT\n"</span><span style="color: #97b098;">)</span>;

      <span style="color: #656C7D;">// </span><span style="color: #656C7D;">On lib&#232;re celle en trop.</span>
      freeWeek<span style="color: #97b098;">(</span>nouvWeek<span style="color: #97b098;">)</span>;

    <span style="color: #b0b1a3;">}</span>

    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Sinon on l'ajoute</span>
    <span style="color: #6E8EE5;">else</span> <span style="color: #b0b1a3;">{</span>
      nouvWeek-&gt;suiv = <span style="color: #97b098;">(</span>*prec<span style="color: #97b098;">)</span>;
      *prec = nouvWeek;
    <span style="color: #b0b1a3;">}</span>
  <span style="color: #93a8c6;">}</span>
  <span style="color: #6E8EE5;">return</span> prec;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="org8afef85"></a>supprWeek (similaire à supprAction)<br />
<div class="outline-text-5" id="text-2-2-2-7">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">void</span> <span style="color: #E9D2AF;">supprWeek</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">listWeek_t</span> *<span style="color: #CBD4EA;">listWeek</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">year</span><span style="color: #93a8c6;">[</span>4<span style="color: #93a8c6;">]</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">week</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #7392E5;">week_t</span> **<span style="color: #CBD4EA;">pprec</span> = findWeek<span style="color: #93a8c6;">(</span>listWeek, year, week<span style="color: #93a8c6;">)</span>; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Comme dans findWeek</span>

  <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Si la semaine correspond bien &#224; celle voulue</span>
  <span style="color: #6E8EE5;">if</span> <span style="color: #93a8c6;">(</span>pprec != <span style="color: #5971B2;">NULL</span> &amp;&amp; *pprec != <span style="color: #5971B2;">NULL</span> &amp;&amp; equalWeek<span style="color: #b0b1a3;">(</span>*pprec, year, week<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">On la supprime</span>
    <span style="color: #7392E5;">week_t</span> *<span style="color: #CBD4EA;">tmp</span> = *pprec; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">pointeur de semaine temporaire</span>
    <span style="color: #b0b1a3;">(</span>*pprec<span style="color: #b0b1a3;">)</span> = <span style="color: #b0b1a3;">(</span>*pprec<span style="color: #b0b1a3;">)</span>-&gt;suiv;
    freeWeek<span style="color: #b0b1a3;">(</span>tmp<span style="color: #b0b1a3;">)</span>;
  <span style="color: #93a8c6;">}</span>
<span style="color: #8c8c8c;">}</span>

</pre>
</div>
</div>
</li>
