tp1/compte_rendu.org
**** suprActionInsideWeek

     Cette fonction ainsi que la suivante sont un peu plus propre au semaine. En
     effet si on veut modifier seulement une action dans notre liste de semaine
     (ce qui est le cas pour notre calendrier) il nous faut parcourir/modifier
     aussi bien les semaines que les actions.
     C'est dans ces fonctions que tout les procédures qu'on à vu avant prennent
     leur sens. Grâce à ces dernières nos deux fonction principaux pour le
     calendrier deviennent très simple à écrire.

     On réalise un premier parcours de la liste des Semaines pour voir si il
     existe une semaine avec l'année et le numéro de semaine donné en
     argument. Si c'est le cas on parcours la liste d'action de cette semaine
     pour trouver l'action concordant avec nos arguments *day* et *hour*. Si
     cette action existe alors il nous suffit de la supprimer. Si l'une de ces
     deux recherches ne concluent pas. Cela veux dire qu'il n'existe pas dans la
     liste l'action à supprimer. On peut donc arrêter là. Enfin en vérifie au
     début de la procédure si nos argument sont correctes, dans le cas inverse
     on peut éviter de chercher car on sait de base qu'il n'y aura rien à
     supprimer.

     #+BEGIN_SRC c
  int supprActionInsideWeek(listWeek_t *listWeek, char year[4], char week[2],
                          char day, char hour[2]) {
  // On cherche la semaine de l'action à supprimer
  int code = 1;
  week_t **precWeek = findWeek(listWeek, year, week);

  // Si elle existe
  if (*precWeek != NULL && equalWeek(*precWeek, year, week)) {

    // On cherche l'action dans cette semaine
    action_t **curr =
        findAction((&(*findWeek(listWeek, year, week))->listAct), hour, day);

    // Si elle existe on la supprime
    if (curr != NULL && equalAction(*curr, day, hour)) {
      supprAction(curr, hour, day);
      if ((*precWeek)->listAct == NULL) {
        supprWeek(precWeek, year, week);
      }
    } else
      code = -1;
  } else
    code = -2;

  return code;
}
#+END_SRC


**** insertActionInsideWeek

     On va appeler dans un premier temps insereWeek qui va nous retourner la semaine
     correspondant au argument fourni. Ensuite on appelle sur la liste d'action de cette
     semaine la fonction insertAction. Les cas ou une action / semaine existe
     déjà sur c'est créneaux sont gérés par la fonction insert.

     #+BEGIN_SRC c
  void insertActionInsideWeek(listWeek_t *listWeek, char year[4], char numWeek[2],
                            char day, char hour[2], char name[10]) {
  // Si notre semaine et action sont cohérentes
  if (checkNumWeek(numWeek) && checkYear(year) && checkDay(day) &&
      checkHour(hour)) {
    // On cherche/insère si besoin la semaine
    // Pas besoin de vérifier si week NULL, en effet on l'a déjà vérifié avec la
    // condition au dessus
    week_t **week = insertWeek(listWeek, newWeek(year, numWeek));
    // On insère l'action
    insertAction(&(*week)->listAct, newAction(day, hour, name));
  }
}
#+END_SRC


