calendar/compte_rendu.html


<li><a id="org772f192"></a>suprActionInsideWeek<br />
<div class="outline-text-5" id="text-2-2-2-8">
<p>
Cette fonction ainsi que la suivante sont un peu plus propre au semaine. En
effet si on veut modifier seulement une action dans notre liste de semaine
(ce qui est le cas pour notre calendrier) il nous faut parcourir/modifier
aussi bien les semaines que les actions.
C'est dans ces fonctions que tout les procédures qu'on à vu avant prennent
leur sens. Grâce à ces dernières nos deux fonction principaux pour le
calendrier deviennent très simple à écrire.
</p>

<p>
On réalise un premier parcours de la liste des Semaines pour voir si il
existe une semaine avec l'année et le numéro de semaine donné en
argument. Si c'est le cas on parcours la liste d'action de cette semaine
pour trouver l'action concordant avec nos arguments <b>day</b> et <b>hour</b>. Si
cette action existe alors il nous suffit de la supprimer. Si l'une de ces
deux recherches ne concluent pas. Cela veux dire qu'il n'existe pas dans la
liste l'action à supprimer. On peut donc arrêter là. Enfin en vérifie au
début de la procédure si nos argument sont correctes, dans le cas inverse
on peut éviter de chercher car on sait de base qu'il n'y aura rien à
supprimer.
</p>

<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">int</span> <span style="color: #E9D2AF;">supprActionInsideWeek</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">listWeek_t</span> *<span style="color: #CBD4EA;">listWeek</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">year</span><span style="color: #93a8c6;">[</span>4<span style="color: #93a8c6;">]</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">week</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span>,
                          <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">day</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">hour</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #656C7D;">// </span><span style="color: #656C7D;">On cherche la semaine de l'action &#224; supprimer</span>
  <span style="color: #7392E5;">int</span> <span style="color: #CBD4EA;">code</span> = 1;
  <span style="color: #7392E5;">week_t</span> **<span style="color: #CBD4EA;">precWeek</span> = findWeek<span style="color: #93a8c6;">(</span>listWeek, year, week<span style="color: #93a8c6;">)</span>;

  <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Si elle existe</span>
  <span style="color: #6E8EE5;">if</span> <span style="color: #93a8c6;">(</span>*precWeek != <span style="color: #5971B2;">NULL</span> &amp;&amp; equalWeek<span style="color: #b0b1a3;">(</span>*precWeek, year, week<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>

    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">On cherche l'action dans cette semaine</span>
    <span style="color: #7392E5;">action_t</span> **<span style="color: #CBD4EA;">curr</span> =
        findAction<span style="color: #b0b1a3;">(</span><span style="color: #97b098;">(</span>&amp;<span style="color: #aebed8;">(</span>*findWeek<span style="color: #b0b0b3;">(</span>listWeek, year, week<span style="color: #b0b0b3;">)</span><span style="color: #aebed8;">)</span>-&gt;listAct<span style="color: #97b098;">)</span>, hour, day<span style="color: #b0b1a3;">)</span>;

    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Si elle existe on la supprime</span>
    <span style="color: #6E8EE5;">if</span> <span style="color: #b0b1a3;">(</span>curr != <span style="color: #5971B2;">NULL</span> &amp;&amp; equalAction<span style="color: #97b098;">(</span>*curr, day, hour<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">{</span>
      supprAction<span style="color: #97b098;">(</span>curr, hour, day<span style="color: #97b098;">)</span>;
      <span style="color: #6E8EE5;">if</span> <span style="color: #97b098;">(</span><span style="color: #aebed8;">(</span>*precWeek<span style="color: #aebed8;">)</span>-&gt;listAct == <span style="color: #5971B2;">NULL</span><span style="color: #97b098;">)</span> <span style="color: #97b098;">{</span>
        supprWeek<span style="color: #aebed8;">(</span>precWeek, year, week<span style="color: #aebed8;">)</span>;
      <span style="color: #97b098;">}</span>
    <span style="color: #b0b1a3;">}</span> <span style="color: #6E8EE5;">else</span>
      code = -1;
  <span style="color: #93a8c6;">}</span> <span style="color: #6E8EE5;">else</span>
    code = -2;

  <span style="color: #6E8EE5;">return</span> code;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>


<li><a id="org348dc63"></a>insertActionInsideWeek<br />
<div class="outline-text-5" id="text-2-2-2-9">
<p>
On va appeler dans un premier temps insereWeek qui va nous retourner la semaine
correspondant au argument fourni. Ensuite on appelle sur la liste d'action de cette
semaine la fonction insertAction. Les cas ou une action / semaine existe
déjà sur c'est créneaux sont gérés par la fonction insert.
</p>

<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">void</span> <span style="color: #E9D2AF;">insertActionInsideWeek</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">listWeek_t</span> *<span style="color: #CBD4EA;">listWeek</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">year</span><span style="color: #93a8c6;">[</span>4<span style="color: #93a8c6;">]</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">numWeek</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span>,
                            <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">day</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">hour</span><span style="color: #93a8c6;">[</span>2<span style="color: #93a8c6;">]</span>, <span style="color: #7392E5;">char</span> <span style="color: #CBD4EA;">name</span><span style="color: #93a8c6;">[</span>10<span style="color: #93a8c6;">]</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Si notre semaine et action sont coh&#233;rentes</span>
  <span style="color: #6E8EE5;">if</span> <span style="color: #93a8c6;">(</span>checkNumWeek<span style="color: #b0b1a3;">(</span>numWeek<span style="color: #b0b1a3;">)</span> &amp;&amp; checkYear<span style="color: #b0b1a3;">(</span>year<span style="color: #b0b1a3;">)</span> &amp;&amp; checkDay<span style="color: #b0b1a3;">(</span>day<span style="color: #b0b1a3;">)</span> &amp;&amp;
      checkHour<span style="color: #b0b1a3;">(</span>hour<span style="color: #b0b1a3;">)</span><span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">On cherche/ins&#232;re si besoin la semaine</span>
    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Pas besoin de v&#233;rifier si week NULL, en effet on l'a d&#233;j&#224; v&#233;rifi&#233; avec la</span>
    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">condition au dessus</span>
    <span style="color: #7392E5;">week_t</span> **<span style="color: #CBD4EA;">week</span> = insertWeek<span style="color: #b0b1a3;">(</span>listWeek, newWeek<span style="color: #97b098;">(</span>year, numWeek<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>;
    <span style="color: #656C7D;">// </span><span style="color: #656C7D;">On ins&#232;re l'action</span>
    insertAction<span style="color: #b0b1a3;">(</span>&amp;<span style="color: #97b098;">(</span>*week<span style="color: #97b098;">)</span>-&gt;listAct, newAction<span style="color: #97b098;">(</span>day, hour, name<span style="color: #97b098;">)</span><span style="color: #b0b1a3;">)</span>;
  <span style="color: #93a8c6;">}</span>
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>
