calendar/compte_rendu.html


<li><a id="orgb1454bc"></a>prettyPrintListWeek (similaire à prettyPrintListAction)<br />
<div class="outline-text-5" id="text-2-2-2-10">
<div class="org-src-container">
<pre class="src src-c">  <span style="color: #7392E5;">void</span> <span style="color: #E9D2AF;">prettyPrintListWeek</span><span style="color: #8c8c8c;">(</span><span style="color: #7392E5;">listWeek_t</span> <span style="color: #CBD4EA;">listWeek</span><span style="color: #8c8c8c;">)</span> <span style="color: #8c8c8c;">{</span>
  <span style="color: #7392E5;">week_t</span> *<span style="color: #CBD4EA;">curr</span> = listWeek; <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Pointeur sur la semaine courante</span>
  <span style="color: #7392E5;">int</span> <span style="color: #CBD4EA;">i</span> = 0;               <span style="color: #656C7D;">// </span><span style="color: #656C7D;">Simple compteur</span>

  printf<span style="color: #93a8c6;">(</span><span style="color: #C27127;">"==========================================================\n"</span><span style="color: #93a8c6;">)</span>;
  <span style="color: #6E8EE5;">while</span> <span style="color: #93a8c6;">(</span>curr<span style="color: #93a8c6;">)</span> <span style="color: #93a8c6;">{</span>
    printf<span style="color: #b0b1a3;">(</span><span style="color: #C27127;">"| %d | week %s | year %s |\n"</span>, i, curr-&gt;numWeek, curr-&gt;year<span style="color: #b0b1a3;">)</span>;
    <span style="color: #6E8EE5;">if</span> <span style="color: #b0b1a3;">(</span>curr-&gt;listAct<span style="color: #b0b1a3;">)</span> <span style="color: #b0b1a3;">{</span>
      printf<span style="color: #97b098;">(</span><span style="color: #C27127;">"Action :::\n"</span><span style="color: #97b098;">)</span>;
      prettyPrintListAction<span style="color: #97b098;">(</span>curr-&gt;listAct<span style="color: #97b098;">)</span>;
      printf<span style="color: #97b098;">(</span><span style="color: #C27127;">"\n\n"</span><span style="color: #97b098;">)</span>;
    <span style="color: #b0b1a3;">}</span>
    i++;
    curr = curr-&gt;suiv;
  <span style="color: #93a8c6;">}</span>
  printf<span style="color: #93a8c6;">(</span><span style="color: #C27127;">"==========================================================\n\n"</span><span style="color: #93a8c6;">)</span>;
<span style="color: #8c8c8c;">}</span>
</pre>
</div>
</div>
</li>
</ol>
</div>
</div>
</div>



<div id="outline-container-org6613b4e" class="outline-2">
<h2 id="org6613b4e"><span class="section-number-2">3.</span> Exécution</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org3d4ccbe" class="outline-3">
<h3 id="org3d4ccbe"><span class="section-number-3">3.1.</span> Makefile</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Le makefile permet de compiler tous les fichiers nécessaires pour obtenir l'exécutable du
menu en une seule commande. Il suffit pour cela d'appeler la commande make
dans le répertoire contenant le fichier makefile.
</p>

<p>
Pour obtenir l'exécutable
de l'ensemble du jeu de test. Il suffit d'appeler de la même façon la
commande make avec comme argument cette fois ci test.
</p>

<p>
Toute les compilations se font avec l'option -g pour pouvoir utiliser valgrind.
</p>

<pre class="example">
  CC = gcc
CFLAGS = -Wall -Wextra
LFLAGS = -g
SOURCES = $(wildcard *.c)
EXEC = prog

all: $(EXEC)

$(EXEC) : menu.o action.o semaine.o
	$(CC) $(CFLAGS) -o $@ $^ $(LFLAGS)

%.o: %.c
	$(CC) $(CFLAGS) -o $@ -c $&lt; $(LFLAGS)

test: test.o action.o semaine.o
	$(CC) $(CFLAGS) -o $@ $^ $(LFLAGS)	
clean: 
	rm -rf *.o

</pre>
</div>
</div>


<div id="outline-container-org6923587" class="outline-3">
<h3 id="org6923587"><span class="section-number-3">3.2.</span> Jeux de tests</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Comme indiqué précédemment, tous les jeux de tests se situent dans le fichier
test.c, il suffit ensuite de compiler et exécuter le programme afin de
vérifier les différents cas. On peut toujours mettre certains test en
commentaires pour faciliter la lecture d'un cas spécifiques.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cliquot Théo &amp; Marie Bornet</p>
<p class="date">Created: 2022-06-20 lun. 10:18</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
