calendar/compte_rendu.tex
  void prettyPrintListWeek(listWeek_t listWeek) {
  week_t *curr = listWeek; // Pointeur sur la semaine courante
  int i = 0;               // Simple compteur

  printf("==========================================================\n");
  while (curr) {
    printf("| %d | week %s | year %s |\n", i, curr->numWeek, curr->year);
    if (curr->listAct) {
      printf("Action :::\n");
      prettyPrintListAction(curr->listAct);
      printf("\n\n");
    }
    i++;
    curr = curr->suiv;
  }
  printf("==========================================================\n\n");
}
\end{lstlisting}
\end{enumerate}



\section{Exécution}
\label{sec:orgd786a0b}

\subsection{Makefile}
\label{sec:orgb86faef}

Le makefile permet de compiler tous les fichiers nécessaires pour obtenir l'exécutable du
menu en une seule commande. Il suffit pour cela d'appeler la commande make
dans le répertoire contenant le fichier makefile.

Pour obtenir l'exécutable
de l'ensemble du jeu de test. Il suffit d'appeler de la même façon la
commande make avec comme argument cette fois ci test.

Toute les compilations se font avec l'option -g pour pouvoir utiliser valgrind.

\begin{verbatim}
  CC = gcc
CFLAGS = -Wall -Wextra
LFLAGS = -g
SOURCES = $(wildcard *.c)
EXEC = prog

all: $(EXEC)

$(EXEC) : menu.o action.o semaine.o
	$(CC) $(CFLAGS) -o $@ $^ $(LFLAGS)

%.o: %.c
	$(CC) $(CFLAGS) -o $@ -c $< $(LFLAGS)

test: test.o action.o semaine.o
	$(CC) $(CFLAGS) -o $@ $^ $(LFLAGS)	
clean: 
	rm -rf *.o

\end{verbatim}


\subsection{Jeux de tests}
\label{sec:orge8e2690}

Comme indiqué précédemment, tous les jeux de tests se situent dans le fichier
test.c, il suffit ensuite de compiler et exécuter le programme afin de
vérifier les différents cas. On peut toujours mettre certains test en
commentaires pour faciliter la lecture d'un cas spécifiques.
\end{document}